<template>
  <section if="about">
    <div class="mx-auto px-4 lg:max-w-7xl lg:px-8">
      
      <div class="">
        <p>ПРИВЕТСТВУЕМ ВАС В НАШЕМ ФИРМЕННОМ ИНТЕРНЕТ-МАГАЗИНЕ «ГЛАВНЫЙ СВАРЩИК»!</p>
        <p>
          Предлагаем вам большой выбор расходных материалов для любых целей: омеднённая, порошковая проволока, электроды. Также, в нашем интернет-магазине вы можете приобрести сопутствующие товары: кабельные разъёмы, электроды, держатели или клеммы заземления, необходимые приспособления при проведении электросварочных работ и многое другое.
          У нас представлен широкий выбор сварочного оборудования и аксессуаров от известных и проверенных производителей, таких как Сварог, Ресанта, Telwin, Кедр, Huter и другие. У нас вы найдете самые привлекательные цены и прогрессивные системы скидок! Если Вы ищите инверторный аппарат, полуавтомат или аргоно-дуговую установку, то доверьтесь нам.
        </p>
        <p>ГАРАНТИРУЕМ хорошее качество продукции и профессиональную консультацию по любым вопросам</p>
        <p>ПОМОЖЕМ Вам сделать выбор среди огромного ассортимента аппаратов для сварки.</p>
        <p>ПОДСКАЖЕМ Вам, как приобрести высококачественное сварочное оборудование.</p>
      </div>
      <div class="">
        <p>
          От нас вы получите:
          Доставку во все регионы России
          Консультации по телефону, e-mail
          Обмен товаров надлежащего и ненадлежащего качества
          Гарантийное обслуживание купленных у нас товаров
        </p>
      </div>
      <div class="">
        Если вы не нашли то, что Вам нужно - свяжитесь с нами и мы найдем этот товар специально для Вас! Покупайте современное сварочное оборудование у нас и помните, качественное оборудование - залог успешной работы!
      </div>
      <div>
        <p>ПРИЯТНЫХ ПОКУПОК!</p>
      </div>      
    </div>

  </section>
</template>